## Python Data Structures and Boolean 

- Boolean
- Boolean and Logical Operators
- Lists
- Comparison operators
- Dictionaries
- Tuples
- Sets

In [43]:
False

False

In [44]:
print(True,False)

True False

In [45]:
type(True)

bool

In [46]:
type(False)

bool

In [47]:
my_str='DataScience123'

In [48]:
my_str.istitle() # it checks whether the first letter of each word is capital or not

False

In [49]:
print(my_str.isalnum()) #check if all char are numbers
print(my_str.isalpha()) #check if all char in the string are alphabetic
print(my_str.isdigit()) #test if string contains digits
print(my_str.istitle()) #test if string contains title words
print(my_str.isupper()) #test if string contains upper case
print(my_str.islower()) #test if string contains lower case
print(my_str.isspace()) #test if string contains spaces
print(my_str.endswith('k')) #test if string endswith a d
print(my_str.startswith('K')) #test if string startswith H

True
False
False
False
False
False
False
False
False

In [50]:
my_str='123'

print(my_str.isalnum()) #check if all char are numbers
print(my_str.isalpha()) #check if all char in the string are alphabetic
print(my_str.isdigit()) #test if string contains digits
print(my_str.istitle()) #test if string contains title words
print(my_str.isupper()) #test if string contains upper case
print(my_str.islower()) #test if string contains lower case
print(my_str.isspace()) #test if string contains spaces
print(my_str.endswith('k')) #test if string endswith a d
print(my_str.startswith('K')) #test if string startswith H

True
False
True
False
False
False
False
False
False

In [51]:
my_str='PrataP'

print(my_str.isalnum()) #check if all char are numbers
print(my_str.isalpha()) #check if all char in the string are alphabetic
print(my_str.isdigit()) #test if string contains digits
print(my_str.istitle()) #test if string contains title words
print(my_str.isupper()) #test if string contains upper case
print(my_str.islower()) #test if string contains lower case
print(my_str.isspace()) #test if string contains spaces
print(my_str.endswith('k')) #test if string endswith a d
print(my_str.startswith('K')) #test if string startswith H

True
True
False
False
False
False
False
False
False

### Boolean and Logical Operators

In [52]:
True and True

True

In [53]:
True and False

False

In [54]:
True or False

True

In [55]:
True or True

True

In [56]:
str_example='Hello World'

In [57]:
my_str='Data'

In [58]:
# Check if the string is alphabetic or numeric
my_str.isalpha() or str_example.isnum() # it checks whether the first letter of each word is capital or not

True

### Lists [ ]

A list is a data structure in Python that is a mutable, or changeable, ordered sequence of elements. Each element or value that is inside of a list is called an item. Just as strings are defined as characters between quotes, lists are defined by having values between square brackets [ ]

In [1]:
# mutable
str1 = "Pratap"
print(type(str1)) # <class 'str'>
print(str1)

<class 'str'>
Pratap

In [3]:
str1 = "Scientiest"
print(str1)

Scientiest

In [5]:
# strings are immutable
str1[0] = "p" # TypeError: 'str' object does not support item assignment

TypeError: 'str' object does not support item assignment

In [6]:
# list [ ]
type([]) # <class 'list'>

list

In [7]:
lst = [1,2,3,4,5,"Pratap", 5.6, True]
print(lst)
print(lst[0]) # 1
print(lst[5]) # Pratap
print(lst[-1]) # True
print(lst[1:5]) # [2, 3, 4, 5]

[1, 2, 3, 4, 5, 'Pratap', 5.6, True]
1
Pratap
True
[2, 3, 4, 5]

In [8]:
# list is mutable
lst = [1,2,3,4,5,"Pratap", 5.6, True]
print(lst)
lst[5] = "data scientist" # changing the value at index 5
print(lst)

[1, 2, 3, 4, 5, 'Pratap', 5.6, True]
[1, 2, 3, 4, 5, 'data scientist', 5.6, True]

In [11]:
lst =list(range(1,11))
print(lst)

lst = list((1,2,3,4,5))
print(lst)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[1, 2, 3, 4, 5]

In [12]:
lst = [1,2,3,4,5]
for i in lst:
    print(i)

1
2
3
4
5

In [13]:
print(len(lst)) # 5
print(max(lst)) # 5
print(min(lst)) # 1
print(sum(lst)) # 15

5
5
1
15

## append - you can only add the elements at the end of the list

In [18]:
lst = [1,2,3,4,5]

lst.append(6) # adding element at the end
print(lst) # [1, 2, 3, 4, 5, 6]

lst.append("numbers")
print(lst) # [1, 2, 3, 4, 5, 6, 'numbers']

lst.append([7,8,9]) # adding list inside list , multiple elements at once(nested list)
print(lst) # [1, 2, 3, 4, 5, 6, 'numbers', [7, 8, 9]]

lst.append(['Data', 'Scientist']) # adding multiple elements at once
print(lst) # [1, 2, 3, 4, 5, 6, 'numbers', [7, 8, 9], ['Data', 'Scientist']]

[1, 2, 3, 4, 5, 6]
[1, 2, 3, 4, 5, 6, 'numbers']
[1, 2, 3, 4, 5, 6, 'numbers', [7, 8, 9]]
[1, 2, 3, 4, 5, 6, 'numbers', [7, 8, 9], ['Data', 'Scientist']]

In [22]:
lst[8] # ['Data', 'Scientist']

['Data', 'Scientist']

In [23]:
lst[8][1] # 'Scientist'

'Scientist'

In [24]:
lst

[1, 2, 3, 4, 5, 6, 'numbers', [7, 8, 9], ['Data', 'Scientist']]

In [26]:
# Indexing and Slicing in list
lst[3:6]

[4, 5, 6]

In [27]:
lst[3:6] = [10,11,12] # changing multiple values at once

In [28]:
lst

[1, 2, 3, 10, 11, 12, 'numbers', [7, 8, 9], ['Data', 'Scientist']]

## Insert  - You can insert any value at any index

In [29]:
lst

[1, 2, 3, 10, 11, 12, 'numbers', [7, 8, 9], ['Data', 'Scientist']]

In [32]:
# insert in a specific index
lst.insert(3, "Pratap") # inserting 15 at index 3
lst

[1,
 2,
 3,
 'Pratap',
 15,
 15,
 10,
 11,
 12,
 'numbers',
 [7, 8, 9],
 ['Data', 'Scientist']]

## Extend method

In [35]:
lst = [1,2,3,4,5]
print(lst)

lst.extend([6,7,8]) # adding multiple elements at last in same list
print(lst) # [1, 2, 3, 4, 5, 6, 7, 8]

lst.extend(["Data", "Scientist"]) # adding in same list
print(lst) # [1, 2, 3, 4, 5, 6, 7, 8, 'Data', 'Scientist']

[1, 2, 3, 4, 5]
[1, 2, 3, 4, 5, 6, 7, 8]
[1, 2, 3, 4, 5, 6, 7, 8, 'Data', 'Scientist']

In [36]:
lst = [1,2,3,4,5]

sum(lst) # 15

15

In [37]:
lst +5 # TypeError: can only concatenate list (not "int") to list

TypeError: can only concatenate list (not "int") to list

In [38]:
# multiplying the list
lst * 2 # [1, 2, 3, 4, 5, 1, 2, 3, 4, 5]

[1, 2, 3, 4, 5, 1, 2, 3, 4, 5]

In [39]:
# divide all elements by 2
# half of each element
for i in lst:
    print(i/2)

0.5
1.0
1.5
2.0
2.5

## pop () method

In [40]:
lst

[1, 2, 3, 4, 5]

In [41]:
lst.pop() # removing last element
print(lst) # [1, 2, 3, 4]

[1, 2, 3, 4]

In [42]:
lst.pop(2) # removing element at index 2 
lst # [1, 2, 4]

[1, 2, 4]

### count():Calculates total occurrence of given element of List

In [60]:
lst=[1,1,2,3,4,5]
lst.count(1) # it counts how many times 1 is present in the list

2

In [61]:
#length:Calculates total length of List
len(lst)

6

In [62]:
# index(): Returns the index of first occurrence. Start and End index are not necessary parameters
lst.index(1,1,4) # it will search for 1 from index 1 to 4 and return the first occurrence index

1

In [65]:
##Min and Max
print(min(lst))
print(max(lst))

1
5

## sets {} - only elements
### A Set is an unordered collection data type that is iterable, mutable, and has no duplicate elements. Python's set class represents the mathematical notion of a set.This is based on a data structure known as a hash table
### Defining an empy set

In [111]:
type({1,2,3,4,5,"data"})

set

In [114]:
set1 = {1,2,3,4,5,5,4} # set will not take duplicate values
print(set1)
print(type(set1))

{1, 2, 3, 4, 5}
<class 'set'>

In [66]:
set_var= set()
print(set_var)
print(type(set_var))

set()
<class 'set'>

In [69]:
set_var={1,2,5,3,4,3} # it will not take duplicate values and show it in ascending order
set_var

{1, 2, 3, 4, 5}

In [119]:
set_var={"Avengers","IronMan",'Hitman'}
print(set_var)
type(set_var)

{'Avengers', 'IronMan', 'Hitman'}

set

In [120]:
set_var.add("Thor") # adding element in set
set_var

{'Avengers', 'Hitman', 'IronMan', 'Thor'}

In [123]:
set_var.add("greatman") # adding element in set
set_var

{'Avengers', 'Hitman', 'IronMan', 'Thor', 'greatman'}

In [ ]:
# set not subscriptable it means we cannot access elements using index

set_var[2] # it will give error as set is unordered collection and indexing is not possible

TypeError: 'set' object is not subscriptable

In [122]:
# Iterate through set
for i in set_var:
    print(i)

Avengers
Thor
IronMan
Hitman

In [ ]:
set_1 = set(4,2,5,6,3,1) # It will give error(set expected at most 1 argument, got 6) it means use [] or () to pass multiple values

TypeError: set expected at most 1 argument, got 6

In [ ]:
# Set will automatically remove duplicate values and show in ascending order
set_1 = set([4,2,5,6,3,1]) # correct way to pass multiple values
print(set_1) # {1, 2, 3, 4, 5, 6}

{1, 2, 3, 4, 5, 6}

In [128]:
set_1.add(0)
print(set_1) # {0, 1, 2, 3, 4, 5, 6}

{0, 1, 2, 3, 4, 5, 6}

In [ ]:
# Set can be used to remove duplicate values from a list
lst=[1,2,3,4,5,5,4,3,2,1]
print(lst)
set_lst=set(lst)
print(set_lst)

[1, 2, 3, 4, 5, 5, 4, 3, 2, 1]
{1, 2, 3, 4, 5}

## Inbuilt function in sets

In [129]:
set1={"Avengers","IronMan",'Hitman'}
set2={"Avengers","IronMan",'Hitman','Hulk2'}
set1.union(set2) # it will combine both sets and remove duplicate values

{'Avengers', 'Hitman', 'Hulk2', 'IronMan'}

In [132]:
set1={"Avengers","IronMan",'Hitman'}
set2={"Avengers","IronMan",'Hitman','Hulk2'}
set1.intersection(set2) # it will return only common values between two sets

{'Avengers', 'Hitman', 'IronMan'}

In [134]:
set1={"Avengers","IronMan",'Hitman'}
set2={"Avengers","IronMan",'Hitman','Hulk2'}
set2.intersection_update(set1) # it will keep only those elements which are common in both set1 and set2
set2

{'Avengers', 'Hitman', 'IronMan'}

## Difference

In [136]:
set1={"Avengers","IronMan",'Hitman'}
set2={"Avengers","IronMan",'Hitman','Hulk2'}

In [139]:
set2.difference(set1) # it will return those elements which are not common in both sets

{'Hulk2'}

In [140]:
set2.difference_update(set1) # it will remove those elements from set2 which are present in set1 and update the set2
print(set2)

{'Hulk2'}

In [141]:
set1={"Avengers","IronMan",'Hitman'}
set2={"Avengers","IronMan",'Hitman','Hulk2'}

In [ ]:
# issuperset check length of both sets and compare which is longer
set1.issuperset(set2) # it will check whether set1 is superset of set2 or not

False

In [ ]:
set2.issuperset(set1) # If set2 has more elements than set1 so it will return True

True

In [146]:
# create a dummy 2 data set and i want to retreive the intersection and union of both sets
data1 = {1,2,3,4,5,6,7,8,9,10}
data2 = {5,6,7,8,9,10,11,12,13,14,15}
data1.union(data2) # it will combine both sets and remove duplicate values
data1.intersection(data2) # it will return only common elements from both sets

{5, 6, 7, 8, 9, 10}

In [147]:
# create 2 list and retrieve the intersection and union of both lists
list1 = [1,2,3,4,5,6,7,8,9,10]
list2 = [5,6,7,8,9,10,11,12,13,14,15]
set(list1).union(set(list2)) # it will combine both sets and remove duplicate values
set(list1).intersection(set(list2)) # it will return only common elements from both sets

{5, 6, 7, 8, 9, 10}

In [158]:
# create a dummy 2 dataframe set of student marks, use pandas and i want to retreive the intersection and union of both sets
import pandas as pd
df1 = pd.DataFrame({'Name':['Alice','Bob','Charlie'],'Marks':[45,50,55]})
df2 = pd.DataFrame({'Name':['Charlie','David','Edward'],'Marks':[55,48,88]})

In [159]:
df1

      Name  Marks
0    Alice     45
1      Bob     50
2  Charlie     55

In [160]:
df2

      Name  Marks
0  Charlie     55
1    David     48
2   Edward     88

In [161]:
df1.merge(df2) # it will return only common elements from both dataframes based on common columns

      Name  Marks
0  Charlie     55

In [162]:
df1.merge(df2, how='outer') # it will return union of both

      Name  Marks
0    Alice     45
1      Bob     50
2  Charlie     55
3    David     48
4   Edward     88

In [ ]:
# create a dummy 2 dataframe set of students, use pandas and i want to retreive the intersection and union of both sets
import pandas as pd
df1 = pd.DataFrame({'A':[1,2,3,4,5],'B':[6,7,8,9,10]})
df2 = pd.DataFrame({'A':[5,6,7,8,9],'B':[10,11,12,13,14]})
df1

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [150]:
df2

   A   B
0  5  10
1  6  11
2  7  12
3  8  13
4  9  14

In [151]:
df1.merge(df2) # it will return only common elements from both dataframes based on common columns
df1.merge(df2, how='outer') # it will return union of both dataframes

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10
5  6  11
6  7  12
7  8  13
8  9  14

## Dictionaries

## A dictionary is a collection which is unordered, changeable and indexed. In Python dictionaries are written with curly brackets, and they have keys and values.

In [164]:
# Key value pair
type({1:"data1"})

dict

In [165]:
dict(name="pratap",age=30)

{'name': 'pratap', 'age': 30}

In [76]:
dic={}

print(type(dic))
print(type(dict()))

<class 'dict'>
<class 'dict'>

In [78]:
set_ex={1,2,3,4,5}
print(type(set_ex))
print(set_ex)

<class 'set'>
{1, 2, 3, 4, 5}

In [166]:
## Let create a dictionary

my_dict={"Car1": "Audi", "Car2":"BMW","Car3":"Mercidies Benz"}
print(my_dict)

{'Car1': 'Audi', 'Car2': 'BMW', 'Car3': 'Mercidies Benz'}

In [167]:
my_dict[0] # it will give error as dictionary is not subscriptable

KeyError: 0

In [169]:
my_dict

{'Car1': 'Audi', 'Car2': 'BMW', 'Car3': 'Mercidies Benz'}

In [168]:
# Access the item values based on keys

my_dict['Car1']

'Audi'

In [82]:
my_dict.get('Car2') # it will also give the value of key Car2

'BMW'

In [170]:
my_dict.items() # it will return all key value pairs in the form of tuples inside a list

dict_items([('Car1', 'Audi'), ('Car2', 'BMW'), ('Car3', 'Mercidies Benz')])

In [171]:
my_dict.keys() # it will return all keys of dictionary

dict_keys(['Car1', 'Car2', 'Car3'])

In [172]:
my_dict.values() # it will return all values of dictionary

dict_values(['Audi', 'BMW', 'Mercidies Benz'])

In [83]:
# We can even loop throught the dictionaries keys

for x in my_dict:
    print(x)

Car1
Car2
Car3

In [90]:
# We can even loop throught the dictionaries values

for x in my_dict.values():
    print(x)

Audi
BMW
Mercidies Benz

In [91]:
# We can also check both keys and values
for x in my_dict.items():
    print(x)

('Car1', 'Audi')
('Car2', 'BMW')
('Car3', 'Mercidies Benz')

In [173]:
## Adding items in Dictionaries

my_dict['Car4']='Audi 2.0' # adding new key value pair
print(my_dict)

{'Car1': 'Audi', 'Car2': 'BMW', 'Car3': 'Mercidies Benz', 'Car4': 'Audi 2.0'}

In [174]:
my_dict['Car1']='Maruti' # changing the value of key Car1
print(my_dict)

{'Car1': 'Maruti', 'Car2': 'BMW', 'Car3': 'Mercidies Benz', 'Car4': 'Audi 2.0'}

## Nested Dictionary

In [ ]:

car1_model={'Mercedes':1960}
car2_model={'Audi':1970}
car3_model={'Ambassador':1980}

In [97]:
# Nested Dictionary

car_type={'car1':car1_model,'car2':car2_model,'car3':car3_model}
print(car_type)

{'car1': {'Mercedes': 1960}, 'car2': {'Audi': 1970}, 'car3': {'Ambassador': 1980}}

In [98]:
print(car_type)

{'car1': {'Mercedes': 1960}, 'car2': {'Audi': 1970}, 'car3': {'Ambassador': 1980}}

In [99]:
## Accessing the items in the dictionary

print(car_type['car1'])

{'Mercedes': 1960}

In [100]:
print(car_type['car1']['Mercedes'])

1960

## Tuples

In [175]:
## create an empty Tuples

my_tuple=tuple()
type(my_tuple)

tuple

In [176]:
my_tuple=("Krish","Ankur","John")

In [177]:
print(type(my_tuple))

<class 'tuple'>

In [178]:

my_tuple=('Hello','World')

In [179]:
my_tuple[0] = "Hi" # it will give error as tuple is immutable

TypeError: 'tuple' object does not support item assignment

In [180]:
my_tuple[0] # accessing element at index 0

'Hello'

In [ ]:
print(my_tuple)
type(my_tuple)

('Hello', 'World')

tuple

In [181]:
my_tuple.index('World') # it will return index of element World

1

In [108]:
my_tuple=("Krish","Ankur","John","Pratap","Krish")

In [109]:
## Inbuilt function
my_tuple.count('Pratap') # it will count how many times Pratap is present in the tuple

1

In [110]:
my_tuple.index('Ankur') # it will give the index of Ankur

1

In [183]:
# Type casting tuples
my_tuple = ("Hello", "World", 25)
my_list = list(my_tuple) # converting tuple to list
my_dict = dict(name="pratap",age=30) # converting dictionary to list
print(my_list)
print(my_dict)

['Hello', 'World', 25]
{'name': 'pratap', 'age': 30}